jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.c
/***********************************************************************************************************************
 * This file was originally generated by the MCUXpresso Config Tools and manually edited.
 * It will be overwritten if the respective MCUXpresso Config Tools are used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
power_domains: {NVCC_EMC: '3.3', NVCC_GPIO: '3.3', VDD_SOC_IN: '1.25', NVCC_SD0: '3.3', DCDC_PSWITCH: '3.3', VDD_SNVS_IN: '3.3', VDD_USB_CAP: '5.0', DCDC_IN: '3.3',
  NVCC_SD1: '1.8', VDD_SNVS_CAP: '3.3', VDDA_ADC_3P3: '3.3', VDD_HIGH_CAP: '3.3', NVCC_PLL: '3.3', VDD_HIGH_IN: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitAdcPins();
    BOARD_InitPwmPins();
//    BOARD_InitEncPins();
//    BOARD_InitLcdPins();
//    BOARD_InitCanPins();
//    BOARD_InitEnetPins();
//    BOARD_InitFlexSPIPins();
//    BOARD_InitUsdhcPins();
    BOARD_InitUartPins();
//    BOARD_InitI2cPins();
//    BOARD_InitSwdPins();
//    BOARD_InitUserButtonPins();
//    BOARD_InitUserLedPins();
    //BOARD_InitAdditionalPins();


    /* GPIO_AD_B1_00~GPIO_AD_B1_05 can only be configured as flexspi function. Note that it can't be modified here */
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_FLEXSPI_A_DATA03, 1U);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_FLEXSPI_A_SCLK, 1U);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_FLEXSPI_A_DATA00, 1U);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_FLEXSPI_A_DATA02, 1U);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_FLEXSPI_A_DATA01, 1U);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_FLEXSPI_A_SS0_B, 1U);
}

void BOARD_InitCMP(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_06_GPIO1_IO22,        /* GPIO_AD_B1_06 is configured as GPIO1_IO22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_B1_07_GPIO1_IO23,        /* GPIO_AD_B1_06 is configured as GPIO1_IO22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
	  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

	  /* GPIO configuration of TP on GPIO_SD_B1_02 (pin 30) */
	  gpio_pin_config_t TP_config = {
	      .direction = kGPIO_DigitalOutput,
	      .outputLogic = 0U,
	      .interruptMode = kGPIO_NoIntmode
	  };
	  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin 30) */
	  GPIO_PinInit(GPIO3, 22U, &TP_config);

	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_02_GPIO3_IO22,        /* GPIO_SD_B1_02 is configured as GPIO3_IO22 */
	      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_02_GPIO3_IO22,        /* GPIO_SD_B1_02 PAD functional properties : */
	      0x10B1U);                               /* Slew Rate Field: Fast Slew Rate
	                                                 Drive Strength Field: R0/6
	                                                 Speed Field: 100MHz - 150MHz
	                                                 Open Drain Enable Field: Open Drain Disabled
	                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
	                                                 Pull / Keep Select Field: Keeper
	                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
	                                                 Hyst. Enable Field: Hysteresis Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitAdcPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitAdcPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitAdcPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */


  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_10_GPIO1_IO26,        /* GPIO_AD_B1_10 is configured as GPIO1_IO26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_11_GPIO1_IO27,        /* GPIO_AD_B1_11 is configured as GPIO1_IO27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_12_GPIO1_IO28,        /* GPIO_AD_B1_12 is configured as GPIO1_IO28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_13_GPIO1_IO29,        /* GPIO_AD_B1_13 is configured as GPIO1_IO29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_08_GPIO1_IO24,        /* GPIO_AD_B1_08 is configured as GPIO1_IO24 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_09_GPIO1_IO25,        /* GPIO_AD_B1_09 is configured as GPIO1_IO25 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//  IOMUXC_SetPinMux(
//      IOMUXC_GPIO_AD_B1_12_GPIO1_IO28,        /* GPIO_AD_B1_12 is configured as GPIO1_IO28 */
//      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_14_GPIO1_IO30,        /* GPIO_AD_B1_14 is configured as GPIO1_IO30 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


