jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPwmPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPwmPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPwmPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_14_FLEXPWM2_PWMA00,   /* GPIO_AD_B0_14 is configured as FLEXPWM2_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_B0_14_FLEXPWM2_PWMA00,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_15_FLEXPWM2_PWMB00,   /* GPIO_AD_B0_15 is configured as FLEXPWM2_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_B0_15_FLEXPWM2_PWMB00,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_12_FLEXPWM2_PWMA01,   /* GPIO_AD_B0_12 is configured as FLEXPWM2_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_B0_12_FLEXPWM2_PWMA01,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_13_FLEXPWM2_PWMB01,   /* GPIO_AD_B0_13 is configured as FLEXPWM2_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_B0_13_FLEXPWM2_PWMB01,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_10_FLEXPWM2_PWMA02,   /* GPIO_AD_B0_10 is configured as FLEXPWM2_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_B0_10_FLEXPWM2_PWMA02,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_11_FLEXPWM2_PWMB02,   /* GPIO_AD_B0_11 is configured as FLEXPWM2_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_B0_11_FLEXPWM2_PWMB02,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00,     /* GPIO_EMC_26 is configured as FLEXPWM1_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_27_FLEXPWM1_PWMB00,     /* GPIO_EMC_27 is configured as FLEXPWM1_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_EMC_27_FLEXPWM1_PWMB00,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_24_FLEXPWM1_PWMA01,     /* GPIO_EMC_24 is configured as FLEXPWM1_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_EMC_24_FLEXPWM1_PWMA01,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_25_FLEXPWM1_PWMB01,     /* GPIO_EMC_25 is configured as FLEXPWM1_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_EMC_25_FLEXPWM1_PWMB01,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_22_FLEXPWM1_PWMA02,     /* GPIO_EMC_22 is configured as FLEXPWM1_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_EMC_22_FLEXPWM1_PWMA02,
      0x10B0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_23_FLEXPWM1_PWMB02,     /* GPIO_EMC_23 is configured as FLEXPWM1_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_EMC_23_FLEXPWM1_PWMB02,
      0x10B0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitEncPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: ENC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_35}
  - {pin_num: C3, peripheral: ENC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_36}
  - {pin_num: E4, peripheral: ENC1, signal: INDEX, pin_signal: GPIO_EMC_37}
  - {pin_num: A6, peripheral: ENC2, signal: 'PHASE, A', pin_signal: GPIO_EMC_13}
  - {pin_num: B6, peripheral: ENC2, signal: 'PHASE, B', pin_signal: GPIO_EMC_14}
  - {pin_num: E11, peripheral: ENC2, signal: INDEX, pin_signal: GPIO_B0_15}
  - {pin_num: B1, peripheral: ENC3, signal: 'PHASE, A', pin_signal: GPIO_EMC_15}
  - {pin_num: A5, peripheral: ENC3, signal: 'PHASE, B', pin_signal: GPIO_EMC_16}
  - {pin_num: A11, peripheral: ENC3, signal: INDEX, pin_signal: GPIO_B1_00}
  - {pin_num: B11, peripheral: ENC4, signal: 'PHASE, A', pin_signal: GPIO_B1_01}
  - {pin_num: C11, peripheral: ENC4, signal: 'PHASE, B', pin_signal: GPIO_B1_02}
  - {pin_num: D11, peripheral: ENC4, signal: INDEX, pin_signal: GPIO_B1_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitEncPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitEncPins(void) {
#ifdef IMAGINARY_DEF
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* xbar1 clock (xbar1_clk_enable): 0x03u */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_15_XBAR1_INOUT13,        /* GPIO_B0_15 is configured as XBAR1_INOUT13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_00_XBAR1_INOUT14,        /* GPIO_B1_00 is configured as XBAR1_INOUT14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_01_XBAR1_INOUT15,        /* GPIO_B1_01 is configured as XBAR1_INOUT15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_02_XBAR1_INOUT16,        /* GPIO_B1_02 is configured as XBAR1_INOUT16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_03_XBAR1_INOUT17,        /* GPIO_B1_03 is configured as XBAR1_INOUT17 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_13_XBAR1_IN25,          /* GPIO_EMC_13 is configured as XBAR1_IN25 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_14_XBAR1_INOUT19,       /* GPIO_EMC_14 is configured as XBAR1_INOUT19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_15_XBAR1_IN20,          /* GPIO_EMC_15 is configured as XBAR1_IN20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_16_XBAR1_IN21,          /* GPIO_EMC_16 is configured as XBAR1_IN21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_35_XBAR1_INOUT18,       /* GPIO_EMC_35 is configured as XBAR1_INOUT18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_36_XBAR1_IN22,          /* GPIO_EMC_36 is configured as XBAR1_IN22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_37_XBAR1_IN23,          /* GPIO_EMC_37 is configured as XBAR1_IN23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR6 = ((IOMUXC_GPR->GPR6 &
    (~(IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_13_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_14_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_15_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_16_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_17_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_18_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_19_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_13(0x00u) /* IOMUXC XBAR_INOUT13 function direction select: 0x00u */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_14(0x00u) /* IOMUXC XBAR_INOUT14 function direction select: 0x00u */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_15(0x00u) /* IOMUXC XBAR_INOUT15 function direction select: 0x00u */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_16(0x00u) /* IOMUXC XBAR_INOUT16 function direction select: 0x00u */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_17(0x00u) /* IOMUXC XBAR_INOUT17 function direction select: 0x00u */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_18(0x00u) /* IOMUXC XBAR_INOUT18 function direction select: 0x00u */
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_19(0x00u) /* IOMUXC XBAR_INOUT19 function direction select: 0x00u */
    );
  XBARA_SetSignalsConnection(XBARA1, kXkXBARA1_InputIomuxXbarInout18, kXBARA1_OutputEnc1PhaseAInput); /* IOMUX_XBAR_INOUT18 output assigned to XBARA1_IN18 input is connected to XBARA1_OUT66 output assigned to ENC1_PHASE_A_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarIn22, kXBARA1_OutputEnc1PhaseBInput); /* IOMUX_XBAR_IN22 output assigned to XBARA1_IN22 input is connected to XBARA1_OUT67 output assigned to ENC1_PHASE_B_INPUT */
  XBARA_SetSignalsConnection(XBARA1, BARA1_InputIomuxXbarIn23, kXBARA1_OutputEnc1Index); /* IOMUX_XBAR_IN23 output assigned to XBARA1_IN23 input is connected to XBARA1_OUT68 output assigned to ENC1_INDEX */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarIn25, kXBARA1_OutputEnc2PhaseAInput); /* IOMUX_XBAR_IN25 output assigned to XBARA1_IN25 input is connected to XBARA1_OUT71 output assigned to ENC2_PHASE_A_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout19, kXBARA1_OutputEnc2PhaseBInput); /* IOMUX_XBAR_INOUT19 output assigned to XBARA1_IN19 input is connected to XBARA1_OUT72 output assigned to ENC2_PHASE_B_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout13, kXBARA1_OutputEnc2Index); /* IOMUX_XBAR_INOUT13 output assigned to XBARA1_IN13 input is connected to XBARA1_OUT73 output assigned to ENC2_INDEX */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarIn20, kXBARA1_OutputEnc3PhaseAInput); /* IOMUX_XBAR_IN20 output assigned to XBARA1_IN20 input is connected to XBARA1_OUT76 output assigned to ENC3_PHASE_A_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarIn21, kXBARA1_OutputEnc3PhaseBInput); /* IOMUX_XBAR_IN21 output assigned to XBARA1_IN21 input is connected to XBARA1_OUT77 output assigned to ENC3_PHASE_B_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout14, kXBARA1_OutputEnc3Index); /* IOMUX_XBAR_INOUT14 output assigned to XBARA1_IN14 input is connected to XBARA1_OUT78 output assigned to ENC3_INDEX */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout15, kXBARA1_OutputEnc4PhaseAInput); /* IOMUX_XBAR_INOUT15 output assigned to XBARA1_IN15 input is connected to XBARA1_OUT81 output assigned to ENC4_PHASE_A_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout16, kXBARA1_OutputEnc4PhaseBInput); /* IOMUX_XBAR_INOUT16 output assigned to XBARA1_IN16 input is connected to XBARA1_OUT82 output assigned to ENC4_PHASE_B_INPUT */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout17, kXBARA1_OutputEnc4Index); /* IOMUX_XBAR_INOUT17 output assigned to XBARA1_IN17 input is connected to XBARA1_OUT83 output assigned to ENC4_INDEX */
#endif
}


